{
    "projects": [
        {
            "name": "PlanetCorp",
            "description": "Un jeu dans lequel vous incarnez un astronaute qui doit miner pour survivre. Ce jeu a été réalisé dans le cadre d'un projet en cours à l'université de Turku, Finlande. Le jeu a été réalisé en Godot avec GDscript dans une équipe de Finlandais, Turques, Coréens et Français. Dans ce projet, j'ai développé une grande partie des systèmes principaux (gestion des scenes et de l'audio), puis ai développé ce qui était nécessaire pour l'avancement du projet (fonctionnalités, gameplay, bugs, petits outils, ...).",
            "image": "images/planetcorp.png",
            "link": "https://pcgd7.itch.io/planetcorp"
        },
        {
            "name": "Bubble Penguin",
            "description": "Un jeu dans lequel vous incarnez un pingouin qui doit récupérer une bulle ! Ce jeu a été réalisé lors de la Global Game Jam de 2025 à Turku, Finlande, dans une équipe composée de Français et de Coréens. Pour le développement de jeu, j'ai créé les musique et intégré des sons. Ensuite, j'ai développé les fonctionnalités manquantes et corrigé des bugs.",
            "image": "images/BubblePenguin.png",
            "link": "https://phiieas.itch.io/bubble-penguin"
        },
        {
            "name": "SonicSnails",
            "description": "Un jeu dans lequel vous incarnez un escargot qui doit aller le plus vite ! Ce jeu a été réalisé lors de la \" Game Jam\" à L'EESI, dans une équipe de développeurs et d'artistes. Dans ce projet, j'ai participé au développement des mécaniques de jeu, développé un outil de changement de scènes et ai travaillé sur l'interface utilisateur, notamment le menu des statistiques.",
            "image": "images/SonicSnail.png",
            "link": "https://phiieas.itch.io/sonic-snail"
        },
        {
            "name": "Application de l'algorithme de Kruskal",
            "description": "",
            "image": ""
        },
        {
            "name": "Solveur de Sudoku",
            "description": "",
            "image": ""
        },
        {
            "name": "Chess 2",
            "description": "",
            "image": ""
        }
    ],

    "categories": {
        "video_game": [
            0, 1, 2
        ],


        "software": [
            3, 4, 5
        ]
    }
}
